zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
#include "management.h"
#include "project.h"

#include "simplc_io.h"
#include "simplc_timer.h"

#include <stm8s.h>
#include "io.h"
#include "uart1.h"
#include "tm1638.h"
#include "flash_eeprom.h"
#include "24cxx.h"
#include "tim5.h"

const ACTION_TypeDef process0[] = {{0, ACTION_NONE, 0}};
const ACTION_TypeDef process1[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, HOME, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process2[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT, 10}, {1, HOME, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process3[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PUSH, 10}, {1, PRINT_UP, 0}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process4[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {0, PUSH, 10}, {1, PRINT_UP, 0}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process5[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT,  0}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, HOME, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process6[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT,  0}, {0, SHIFT, 10}, {0, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT, 10}, {1, HOME, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process7[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT,  0}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, SHIFT, 10}, {1, PRINT, 10}, {1, HOME, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process8[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT,  0}, {0, SHIFT, 10}, {0, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT, 10}, {0, SHIFT, 10}, {0, PRINT, 10}, {1, HOME, 10}, {0, ACTION_NONE, 0}};
const ACTION_TypeDef process9[] = {{1, ABSORB, 10}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, SHIFT, 10}, {1, PRINT_UP,  0}, {1, HOME, 10}, {0, ACTION_NONE, 0}};

//const ACTION_TypeDef process1[PROCESS1_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process2[PROCESS2_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process3[PROCESS3_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, PUSH, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process4[PROCESS4_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {0, PUSH, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process5[PROCESS5_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process6[PROCESS6_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process7[PROCESS7_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, SHIFT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {1, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process8[PROCESS8_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, SHIFT, 10}, {0, PRINT_DOWN, 10}, {0, PRINT_UP,  0}, {0, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};
//const ACTION_TypeDef process9[PROCESS9_SIZE] = {{1, ABSORB_DOWN, 10}, {1, ABSORB_UP,  0}, {1, FRONT, 10}, {1, PRINT_DOWN, 10}, {1, SHIFT, 10}, {1, PRINT_UP,  0}, {1, RETURN, 10}, {1, BACK, 10}, {0, ACTION_NONE, 0}};


PROJECT_TypeDef project;

void Program0Read(void)
{
    uint8_t i, j;
    
    for(i=0,j=0;i<MAX_ACTIONS_PER_PROJECT;i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        project.program[i].delay = 1;
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        j += 3;
    }
}

//
void Program0Save(void)
{
    uint8_t i, j;
    
    for(i=0,j=0;i<MAX_ACTIONS_PER_PROJECT;i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, project.program[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, project.program[i].act);
        project.program[i].delay = 1;
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, project.program[i].delay);
        j += 3;
    }
}

//程序恢复出厂设置
void ProgramResetDefault(void)
{
    uint16_t i, j;
    //uint8_t temp;
    
