zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
    UART1_printf("Program reset default data...\r\n");

    AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM_NUM, 1);
    AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);//需要保存3次才能成功
    AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);
    AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);
    //AT24CXX_WriteLenByte(EEPROM_ADDR_RETURNFILTERTIME, RETURN_FILTER_TIME, 2);
    //AT24CXX_WriteLenByte(EEPROM_ADDR_RETURNPOSTIME, RETURN_POS_TIME, 2);
    //AT24CXX_WriteLenByte(EEPROM_ADDR_PUSHTIME, PUSH_TIME, 2);
    AT24CXX_WriteLenByte(EEPROM_ADDR_ACTIONUNITDELAY, ACTIONUNIT_DELAY, 2);
    AT24CXX_WriteLenByte(EEPROM_ADDR_ACTIONUNITDELAY, ACTIONUNIT_DELAY, 2);
    AT24CXX_WriteLenByte(EEPROM_ADDR_ACTIONUNITDELAY, ACTIONUNIT_DELAY, 2);
    
    UART1_printf("++++The default data is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_DEFAULT));
    UART1_printf("++++The prgramNum is %d\r\n", AT24CXX_ReadOneByte(EEPROM_ADDR_PROGRAM_NUM));
    UART1_printf("++++The productOutput is %d\r\n", (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 2));
//    UART1_printf("++++The returnFilterTime is %d\r\n", (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_RETURNFILTERTIME, 2));
//    UART1_printf("++++The returnPosTime is %d\r\n", (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_RETURNPOSTIME, 2));
//    UART1_printf("++++The pushTime is %d\r\n", (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_PUSHTIME, 2));
    UART1_printf("++++The actionUnitDelay is %d\r\n", (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_ACTIONUNITDELAY, 2));
    
    for(i=0,j=0;i<SIZEOF(process1);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j, process1[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j, process1[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j, process1[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j+1, process1[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j+1, process1[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j+1, process1[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j+2, process1[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j+2, process1[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM1+j+2, process1[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process2);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j, process2[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j, process2[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j, process2[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j+1, process2[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j+1, process2[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j+1, process2[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j+2, process2[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j+2, process2[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM2+j+2, process2[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process3);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j, process3[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j, process3[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j, process3[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j+1, process3[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j+1, process3[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j+1, process3[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j+2, process3[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j+2, process3[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM3+j+2, process3[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process4);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j, process4[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j, process4[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j, process4[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j+1, process4[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j+1, process4[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j+1, process4[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j+2, process4[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j+2, process4[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM4+j+2, process4[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process5);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j, process5[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j, process5[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j, process5[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j+1, process5[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j+1, process5[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j+1, process5[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j+2, process5[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j+2, process5[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM5+j+2, process5[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process6);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j, process6[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j, process6[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j, process6[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j+1, process6[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j+1, process6[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j+1, process6[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j+2, process6[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j+2, process6[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM6+j+2, process6[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process7);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j, process7[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j, process7[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j, process7[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j+1, process7[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j+1, process7[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j+1, process7[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j+2, process7[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j+2, process7[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM7+j+2, process7[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process8);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j, process8[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j, process8[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j, process8[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j+1, process8[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j+1, process8[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j+1, process8[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j+2, process8[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j+2, process8[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM8+j+2, process8[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process9);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j, process9[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j, process9[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j, process9[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j+1, process9[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j+1, process9[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j+1, process9[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j+2, process9[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j+2, process9[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM9+j+2, process9[i].delay);
        j += 3;
    }
    for(i=0,j=0;i<SIZEOF(process0);i++)
    {
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, process0[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, process0[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j, process0[i].flag);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, process0[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, process0[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+1, process0[i].act);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, process0[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, process0[i].delay);
        AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM0+j+2, process0[i].delay);
        j += 3;
    }
    
    AT24CXX_WriteOneByte(EEPROM_ADDR_DEFAULT, 0x55);//二进制85，这句要放到最后
    AT24CXX_WriteOneByte(EEPROM_ADDR_DEFAULT, 0x55);
    AT24CXX_WriteOneByte(EEPROM_ADDR_DEFAULT, 0x55);
    
