zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
    UART1_printf("Program reset default data finish!\r\n");
}

//读取程序
void ProgramRead(void)
{
    uint16_t i, j;
    
    UART1_printf("Start reading Program...\r\n");
    
    //初始化project结构体
    project.programNum = AT24CXX_ReadOneByte(EEPROM_ADDR_PROGRAM_NUM);//读取程序序号
    project.productOutput =  (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 2);
    project.returnFilterTime = (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_RETURNFILTERTIME, 2);
    project.returnPosTime = (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_RETURNPOSTIME, 2);
    project.pushTime = (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_PUSHTIME, 2); 
    project.actionUnitDelay = (uint16_t)AT24CXX_ReadLenByte(EEPROM_ADDR_ACTIONUNITDELAY, 2);
    
    //project.returnPosTime = RETURN_POS_TIME;
    //project.actionUnitDelay = 1;
      
    //刷新数码管
    sprintf((char*)project.segStr, "Pro%2d", project.programNum);
    TM1638_SendData(0, project.segStr);
    
//    UART1_printf("EEPROM_ADDR_PROGRAM0 = %d\r\n", EEPROM_ADDR_PROGRAM0);
//    UART1_printf("EEPROM_ADDR_PROGRAM1 = %d\r\n", EEPROM_ADDR_PROGRAM1);
//    UART1_printf("EEPROM_ADDR_PROGRAM2 = %d\r\n", EEPROM_ADDR_PROGRAM2);
//    UART1_printf("EEPROM_ADDR_PROGRAM3 = %d\r\n", EEPROM_ADDR_PROGRAM3);
//    UART1_printf("EEPROM_ADDR_PROGRAM4 = %d\r\n", EEPROM_ADDR_PROGRAM4);
//    UART1_printf("EEPROM_ADDR_PROGRAM5 = %d\r\n", EEPROM_ADDR_PROGRAM5);
//    UART1_printf("EEPROM_ADDR_PROGRAM6 = %d\r\n", EEPROM_ADDR_PROGRAM6);
//    UART1_printf("EEPROM_ADDR_PROGRAM7 = %d\r\n", EEPROM_ADDR_PROGRAM7);
//    UART1_printf("EEPROM_ADDR_PROGRAM8 = %d\r\n", EEPROM_ADDR_PROGRAM8);
//    UART1_printf("EEPROM_ADDR_PROGRAM9 = %d\r\n", EEPROM_ADDR_PROGRAM9);
    
    //读取当前选择的程序
    switch(project.programNum)
    {
        case 0:
            project.programAddr = EEPROM_ADDR_PROGRAM0;
            project.platformHomeFlag = 0;
        break;
        case 1:
            project.programAddr = EEPROM_ADDR_PROGRAM1;
            project.platformHomeFlag = 1;
        break;
        case 2:
            project.programAddr = EEPROM_ADDR_PROGRAM2;
            project.platformHomeFlag = 0;
        break;
        case 3:
            project.programAddr = EEPROM_ADDR_PROGRAM3;
            project.platformHomeFlag = 1;
        break;
        case 4:
            project.programAddr = EEPROM_ADDR_PROGRAM4;
            project.platformHomeFlag = 0;
        break;
        case 5:
            project.programAddr = EEPROM_ADDR_PROGRAM5;
            project.platformHomeFlag = 1;
        break;
        case 6:
            project.programAddr = EEPROM_ADDR_PROGRAM6;
            project.platformHomeFlag = 0;
        break;
        case 7:
            project.programAddr = EEPROM_ADDR_PROGRAM7;
            project.platformHomeFlag = 1;
        break;
        case 8:
            project.programAddr = EEPROM_ADDR_PROGRAM8;
            project.platformHomeFlag = 0;
        break;
        case 9:
            project.programAddr = EEPROM_ADDR_PROGRAM9;
            project.platformHomeFlag = 1;
        break;
        default:
            project.programAddr = EEPROM_ADDR_PROGRAM2;
            project.platformHomeFlag = 0;
        break;
    }

    i = 0;
    j = 0;
    project.program[j].flag = AT24CXX_ReadOneByte(project.programAddr+i);
    project.program[j].act = (ACT_TypeDef)AT24CXX_ReadOneByte(project.programAddr+i+1);
    project.program[j].delay = AT24CXX_ReadOneByte(project.programAddr+i+2);
    UART1_printf("----project.program[%d].flag = %d\r\n", j, project.program[j].flag);
    UART1_printf("----project.program[%d].act = %d\r\n", j, project.program[j].act);
    UART1_printf("----project.program[%d].delay = %d\r\n", j, project.program[j].delay);
    project.actionCnt = 1;
    while(project.program[j].act != ACTION_NONE)
    {
        i += 3;
        j++;
        if(j >= 40) break;
        project.program[j].flag = AT24CXX_ReadOneByte(project.programAddr+i);
        project.program[j].act = (ACT_TypeDef)AT24CXX_ReadOneByte(project.programAddr+i+1);
        project.program[j].delay = AT24CXX_ReadOneByte(project.programAddr+i+2);
        UART1_printf("----project.program[%d].flag = %d\r\n", j, project.program[j].flag);
        UART1_printf("----project.program[%d].act = %d\r\n", j, project.program[j].act);
        UART1_printf("----project.program[%d].delay = %d\r\n", j, project.program[j].delay);
        project.actionCnt++;
    }
    
    project.actionCnt--;
    project.actionPos = 0;
    project.pCurAction = project.program;
    project.delay = project.pCurAction->delay;
    
    UART1_printf("\r\n");
    UART1_printf("----The Program num is %d\r\n", project.programNum);
    UART1_printf("----The Program address is %d\r\n", project.programAddr);
    UART1_printf("----The Program action count is %d\r\n", project.actionCnt);

    UART1_printf("----The productOutput is %d\r\n", project.productOutput);
//    UART1_printf("----The returnFilterTime is %d\r\n", project.returnFilterTime);
//    UART1_printf("----The returnPosTime is %d\r\n", project.returnPosTime);
//    UART1_printf("----The pushTime is %d\r\n", project.pushTime);
    UART1_printf("----The actionUnitDelay is %d\r\n", project.actionUnitDelay);
    
    UART1_printf("EEPROM_ADDR_END = %d\r\n", EEPROM_ADDR_END);
}

void Project_Run(void)
{
    //产量清0
    if(GMR(M_KEY_CLEAR))
    {
        project.productOutput = 0;
        sprintf((char*)project.segStr, "%5d", project.productOutput);
        TM1638_SendData(0, project.segStr);
        
        AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);
        AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, 0, 2);
    }
    
    //按键声音
    if(GML(M_KEY_FAST) || GML(M_KEY_SLOW) || GML(M_KEY_AUX) || GML(M_KEY_UPDOWN) || GML(M_KEY_FRONTBACK)
       || GML(M_KEY_STARTSTOP) || GML(M_KEY_FOOT) || GML(M_KEY_CLEAR))
    {
        TIM2_Cmd(ENABLE);
        SML(M_BEEPER, 1);
        TS(2, 100);
    }
    if(GML(M_BEEPER) && TG(2))
    {
        SML(M_BEEPER, 0);
        TIM2_Cmd(DISABLE);
    }
    
    //LED灯
    GYL(Y_UPDOWN) ? (project.led |= 0x02) : (project.led &= ~0x02); 
    GYL(Y_FRONTBACK) ? (project.led |= 0x01) : (project.led &= ~0x01);
    GYL(Y_SHIFT) ? (project.led |= 0x04) : (project.led &= ~0x04);  
    sprintf((char*)project.segStr, "%d", project.led);
    TM1638_LED(5, project.segStr);
      
