zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/project.c
    //上电
    if(GMR(M_POWERON))
    {
        if(GML(M_KEY_FRONTBACK))//选择程序
        {
            project.mode = PROGRAM_SEL;
            SML(M_PROGRAM_SEL, 1);
            
            UART1_printf("Bootloader : Program select...\r\n");
        }
        else//正常启动
        {
            project.mode = NORMAL;
            SML(M_PROGRAM_READ, 1);
            
            UART1_printf("Bootloader : Normal...\r\n");
        }
    }
    
    //模式选择
    if(project.mode == PROGRAM_SEL)//选择程序
        ProgramSelect();
    else if(project.mode == PROGRAM_SELF)//自编程
    {
        ProgramSelf();
    }
    else if(project.mode == NORMAL)//正常启动
    {
        //static uint8_t flashCnt = 0;
        
        //读取程序编号
        if(GML(M_PROGRAM_READ))
        {
            ProgramRead();
            
            SML(M_PROGRAM_READ, 0);
            
            SML(M_SEG_FLASH, 1);
        }
        
        //闪烁
        if(GML(M_SEG_FLASH))
        {
            SegFlash();
        }
        
        //按键识别
        if(GML(M_PROGRAM_READY))
        {
            KeyDistinguish();
        }
        
        //检查平台最后是否回位到位
        if(GML(M_HOME_CHECK))
        {
            if(project.platformState == 1)
            {
                if(GXF(X_SHIFT_L2))
                {
                    SYL(Y_POS, 0);//再将定位气缸收回来
                    
                    project.platformState = 2;
                }
            }
            else
            {
                if(GXL(X_SHIFT_O))
                {
                    SML(M_HOME_FINISH, 1);
                    SML(M_HOME_CHECK, 0);
                    
                    project.platformPos = 0;
                    
                    project.platformState = 0;
                }
            }
        }
        
/***********************************执行动作***********************************/
        if(GML(M_MODE_AUTO))
        {
            //每个动作都有的一段延时
            if(project.delay)//需要延时
            {
                if(!GML(M_ACTION_DELAY))
                {
                    TS(0, project.actionUnitDelay);//动作延时最小单位
                    SML(M_ACTION_DELAY, 1);
                }
                else if(TG(0))
                {
                    project.delay--;
                    SML(M_ACTION_DELAY, 0);
                }
            }
            else//延时时间到
            {
                switch(project.pCurAction->act)//动作识别
                {
                    case ABSORB_DOWN://吸油下
                        AbsorbDown();
                    break;
                    case ABSORB_UP://吸油上
                        AbsorbUp();
                    break;
                    case ABSORB://吸油
                        Absorb();
                    break;
                    case FRONT://前进
                        Front();
                    break;
                    case BACK://后退
                        Back();
                    break;
                    case PRINT_DOWN://印油下
                        PrintDown();
                    break;
                    case PRINT_UP://印油上
                        PrintUp();
                    break;
                    case PRINT://印油
                        Print();
                    break;
                    case SHIFT://移位
                        Shift();
                    break;
                    case RETURN://回位
                        Return();
                    break;
                    case PUSH://推送
                        Push();
                    break;
                    case HOME://回原点
                        Home();
                    break;
                    default:
                    break;
                }//动作识别
            }//延时时间到
        }
        
 /***************************************执行手动程序******************************/
        if(GML(M_MODE_MANUAL))
        {
            if(GML(M_MAN_UPDOWN))
            {
                if(project.programNum == 9)
                {
                    if(project.printHeadPos&FRONTBACK_MASK)
                    {
                        if(project.printHeadPos&UPDOWN_MASK)
                            PrintUp();
                        else
                            PrintDown();
                    }
                    else
                        Absorb();
                }
                else
                {
                    if(project.printHeadPos&FRONTBACK_MASK)
                        Print();
                    else
                        Absorb();
                }
            }
            if(GML(M_MAN_FRONTBACK))
            {
                if(project.printHeadPos&FRONTBACK_MASK)
                    Back();
                else
                    Front();
            }
            if(GML(M_MAN_AUX))
            {
                if(GML(M_MAN_AUX_RETURN))
                    Return();
                else
                    Shift();
                
                SML(M_MAN_FLAG_AUX, 1);
            }
            
            if(!GML(M_MAN_UPDOWN) && !GML(M_MAN_FRONTBACK) && !GML(M_MAN_AUX))
                SML(M_MODE_MANUAL, 0);
        }
      
/**************************************恢复自动状态************************************/        
        else if(GML(M_MODE_RESTORE))
        {
            //UART1_printf("Restore mode.\r\n");
          
            if(GML(M_RESTORE_UP))
            {
                if(project.printHeadPos&FRONTBACK_MASK)
                    PrintUp();
                else
                    AbsorbUp();
            }
            
            if(!GML(M_RESTORE_UP) && GML(M_RESTORE_HOME))
            {
//                if(project.platformHomeFlag)
                    Home();
//                else
//                {
//                    if(GML(M_PROGRAM_AUX))
//                        Home();
//                    else
//                        PrintHeadHome();
//                }
            }
            
            if(!GML(M_RESTORE_UP) && !GML(M_RESTORE_HOME))
            {
                SML(M_MODE_RESTORE, 0);
                SML(M_MODE_AUTO, 1);
                
                project.actionPos = 0;
                project.pCurAction = project.program + project.actionPos;
                project.delay = project.pCurAction->delay;
                
                UART1_printf("Restore finish.\r\n\r\n");
            }
        }
    }
}
